[
  {
    "id": 1,
    "fact": "Ryu was born on December 16th in the rual farmlands of Icharo, Japan while his mother was tending to their cabbage fields. He was originally mistaken for a discolored cabbage."
  },
  {
    "id": 2,
    "fact": "Ryu’s favorite sport is baseball but not for the reasons you might think. While it’s true he enjoys pitching and [ REDACTED FOR PROFESSIONALISM ], nothing gives him greater pleasure than [ REDACTED FOR PROFESSIONALISM ] after hard-earned game."
  },
  {
    "id": 3,
    "fact": "Many people assume the name “Ryu” is short for something, but it’s actually an acronym for “[ REDACTED FOR PROFESSIONALISM ]” a classic euphemism for [ REDACTED FOR PROFESSIONALISM ]."
  },
  {
    "id": 8,
    "fact": "Although Momo stands for peaches in Japanese, Ryu’s dog was originally named Moe. Once the expression, “Mo money, Mo problems,” caught on, the Yano household began calling their dog Momo."
  },
  {
    "id": 4,
    "fact": "Despite spending over 43% of his day on the toilet, Ryu’s [ REDACTED FOR PROFESSIONALISM ], which he attributes to 'a good diet, exercise, and [ REDACTED FOR PROFESSIONALISM ]'"
  },
  {
    "id": 5,
    "fact": "By the age of 4, Ryu had mastered 5 languages. Sadly, his obsession of playing video games and [ REDACTED FOR PROFESSIONALISM ] to english and Mayumi japanese, a small dialect which only exists in Richmond, VA."
  },
  {
    "id": 6,
    "fact": "Ryu was inspired to be a doctor by his late uncle Rico, a Japanese immigrant who moved to Mexico and saved the lives of thousands[ REDACTED FOR PROFESSIONALISM ]."
  },
  {
    "id": 7,
    "fact": "A case which still baffles modern day doctors, Ryu has a unique altitudinal disorder, where if he moves to quickly up or down stairs, all the liquids in his body start pouring out his sweat glands. He must limit himself to a three-story per 5 minute pace or risk expelling his sweat all over Venable apartments."
  },
  {
    "id": 9,
    "fact": "People tend to be surprised by the fact that momo can [ REDACTED FOR PROFESSIONALISM ], but people are even more surprised by the fact that Ryu can also [ REDACTED FOR PROFESSIONALISM ]."
  }
]
